In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [15]:
import pandas as pd
import numpy as np

In [3]:
pd.read_csv('titanic.csv')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# who to create series

In [5]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

# who to create data

In [ ]:
pd.date_range("20250318", periods=6)

DatetimeIndex(['2025-03-18', '2025-03-19', '2025-03-20', '2025-03-21',
               '2025-03-22', '2025-03-23'],
              dtype='datetime64[ns]', freq='D')

# who to create dataframe

In [17]:
df=pd.DataFrame(
    {"Name":['Anwar','Bilal','Asad','Anwar','Bilal','Asad'],
    "Email":['anwar145@gmail.com','anwar786@gmail.com','anwar453@gmail.com',np.nan,'null','null'],
    "Contact":['03135433979','03135433989','03135433808','03135433979','03135433989','03135433808']
    }
)

In [18]:
df

    Name               Email      Contact
0  Anwar  anwar145@gmail.com  03135433979
1  Bilal  anwar786@gmail.com  03135433989
2   Asad  anwar453@gmail.com  03135433808
3  Anwar                 NaN  03135433979
4  Bilal                null  03135433989
5   Asad                null  03135433808

In [19]:
df.head(1)

    Name               Email      Contact
0  Anwar  anwar145@gmail.com  03135433979

In [21]:
df.tail(1)

   Name Email      Contact
5  Asad  null  03135433808

In [23]:
df.loc[3]

Name             Anwar
Email              NaN
Contact    03135433979
Name: 3, dtype: object